Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_NETC_SW.h
/*! @name CBDRBAR1 - Command BDR 0 base address register 1..Command BDR 1 base address register 1 */
/*! @{ */

#define NETC_SW_CBDRBAR1_ADDRH_MASK              (0xFFFFFFFFU)
#define NETC_SW_CBDRBAR1_ADDRH_SHIFT             (0U)
#define NETC_SW_CBDRBAR1_ADDRH(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRBAR1_ADDRH_SHIFT)) & NETC_SW_CBDRBAR1_ADDRH_MASK)
/*! @} */

/* The count of NETC_SW_CBDRBAR1 */
#define NETC_SW_CBDRBAR1_COUNT                   (2U)

/*! @name CBDRPIR - Command BDR 0 producer index register..Command BDR 1 producer index register */
/*! @{ */

#define NETC_SW_CBDRPIR_BDR_INDEX_MASK           (0x3FFU)
#define NETC_SW_CBDRPIR_BDR_INDEX_SHIFT          (0U)
#define NETC_SW_CBDRPIR_BDR_INDEX(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRPIR_BDR_INDEX_SHIFT)) & NETC_SW_CBDRPIR_BDR_INDEX_MASK)
/*! @} */

/* The count of NETC_SW_CBDRPIR */
#define NETC_SW_CBDRPIR_COUNT                    (2U)

/*! @name CBDRCIR - Command BDR 0 consumer index register..Command BDR 1 consumer index register */
/*! @{ */

#define NETC_SW_CBDRCIR_BDR_INDEX_MASK           (0x3FFU)
#define NETC_SW_CBDRCIR_BDR_INDEX_SHIFT          (0U)
#define NETC_SW_CBDRCIR_BDR_INDEX(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRCIR_BDR_INDEX_SHIFT)) & NETC_SW_CBDRCIR_BDR_INDEX_MASK)
/*! @} */

/* The count of NETC_SW_CBDRCIR */
#define NETC_SW_CBDRCIR_COUNT                    (2U)

/*! @name CBDRLENR - Command BDR 0 length register..Command BDR 1 length register */
/*! @{ */

#define NETC_SW_CBDRLENR_LENGTH_MASK             (0x7F8U)
#define NETC_SW_CBDRLENR_LENGTH_SHIFT            (3U)
#define NETC_SW_CBDRLENR_LENGTH(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRLENR_LENGTH_SHIFT)) & NETC_SW_CBDRLENR_LENGTH_MASK)
/*! @} */

/* The count of NETC_SW_CBDRLENR */
#define NETC_SW_CBDRLENR_COUNT                   (2U)

/*! @name CBDRIER - Command BDR 0 interrupt enable register..Command BDR 1 interrupt enable register */
/*! @{ */

#define NETC_SW_CBDRIER_CBDCIE_MASK              (0x1U)
#define NETC_SW_CBDRIER_CBDCIE_SHIFT             (0U)
#define NETC_SW_CBDRIER_CBDCIE(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRIER_CBDCIE_SHIFT)) & NETC_SW_CBDRIER_CBDCIE_MASK)
/*! @} */

/* The count of NETC_SW_CBDRIER */
#define NETC_SW_CBDRIER_COUNT                    (2U)

/*! @name CBDRIDR - Command BDR 0 interrupt detect register..Command BDR 1 interrupt detect register */
/*! @{ */

#define NETC_SW_CBDRIDR_CBDC_MASK                (0x1U)
#define NETC_SW_CBDRIDR_CBDC_SHIFT               (0U)
/*! CBDC
 *  0b0..No BD with CI=1 completed
 *  0b1..Processed BD with CI=1
 */
#define NETC_SW_CBDRIDR_CBDC(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRIDR_CBDC_SHIFT)) & NETC_SW_CBDRIDR_CBDC_MASK)
/*! @} */

/* The count of NETC_SW_CBDRIDR */
#define NETC_SW_CBDRIDR_COUNT                    (2U)

/*! @name CBDRMSIVR - Command BDR 0 MSI-X vector register..Command BDR 1 MSI-X vector register */
/*! @{ */

#define NETC_SW_CBDRMSIVR_VECTOR_MASK            (0xFU)
#define NETC_SW_CBDRMSIVR_VECTOR_SHIFT           (0U)
#define NETC_SW_CBDRMSIVR_VECTOR(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_CBDRMSIVR_VECTOR_SHIFT)) & NETC_SW_CBDRMSIVR_VECTOR_MASK)
/*! @} */

/* The count of NETC_SW_CBDRMSIVR */
#define NETC_SW_CBDRMSIVR_COUNT                  (2U)

/*! @name QOSVLANMPR - QoS to VLAN mapping profile 0 register 0..QoS to VLAN mapping profile 1 register 3 */
/*! @{ */

#define NETC_SW_QOSVLANMPR_IPV0_DR0_MASK         (0xFU)
#define NETC_SW_QOSVLANMPR_IPV0_DR0_SHIFT        (0U)
#define NETC_SW_QOSVLANMPR_IPV0_DR0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV0_DR0_SHIFT)) & NETC_SW_QOSVLANMPR_IPV0_DR0_MASK)

#define NETC_SW_QOSVLANMPR_IPV2_DR0_MASK         (0xFU)
#define NETC_SW_QOSVLANMPR_IPV2_DR0_SHIFT        (0U)
#define NETC_SW_QOSVLANMPR_IPV2_DR0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV2_DR0_SHIFT)) & NETC_SW_QOSVLANMPR_IPV2_DR0_MASK)

#define NETC_SW_QOSVLANMPR_IPV4_DR0_MASK         (0xFU)
#define NETC_SW_QOSVLANMPR_IPV4_DR0_SHIFT        (0U)
#define NETC_SW_QOSVLANMPR_IPV4_DR0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV4_DR0_SHIFT)) & NETC_SW_QOSVLANMPR_IPV4_DR0_MASK)

#define NETC_SW_QOSVLANMPR_IPV6_DR0_MASK         (0xFU)
#define NETC_SW_QOSVLANMPR_IPV6_DR0_SHIFT        (0U)
#define NETC_SW_QOSVLANMPR_IPV6_DR0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV6_DR0_SHIFT)) & NETC_SW_QOSVLANMPR_IPV6_DR0_MASK)

#define NETC_SW_QOSVLANMPR_IPV0_DR1_MASK         (0xF0U)
#define NETC_SW_QOSVLANMPR_IPV0_DR1_SHIFT        (4U)
#define NETC_SW_QOSVLANMPR_IPV0_DR1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV0_DR1_SHIFT)) & NETC_SW_QOSVLANMPR_IPV0_DR1_MASK)

#define NETC_SW_QOSVLANMPR_IPV2_DR1_MASK         (0xF0U)
#define NETC_SW_QOSVLANMPR_IPV2_DR1_SHIFT        (4U)
#define NETC_SW_QOSVLANMPR_IPV2_DR1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV2_DR1_SHIFT)) & NETC_SW_QOSVLANMPR_IPV2_DR1_MASK)

#define NETC_SW_QOSVLANMPR_IPV4_DR1_MASK         (0xF0U)
#define NETC_SW_QOSVLANMPR_IPV4_DR1_SHIFT        (4U)
#define NETC_SW_QOSVLANMPR_IPV4_DR1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV4_DR1_SHIFT)) & NETC_SW_QOSVLANMPR_IPV4_DR1_MASK)

#define NETC_SW_QOSVLANMPR_IPV6_DR1_MASK         (0xF0U)
#define NETC_SW_QOSVLANMPR_IPV6_DR1_SHIFT        (4U)
#define NETC_SW_QOSVLANMPR_IPV6_DR1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV6_DR1_SHIFT)) & NETC_SW_QOSVLANMPR_IPV6_DR1_MASK)

#define NETC_SW_QOSVLANMPR_IPV0_DR2_MASK         (0xF00U)
#define NETC_SW_QOSVLANMPR_IPV0_DR2_SHIFT        (8U)
#define NETC_SW_QOSVLANMPR_IPV0_DR2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV0_DR2_SHIFT)) & NETC_SW_QOSVLANMPR_IPV0_DR2_MASK)

#define NETC_SW_QOSVLANMPR_IPV2_DR2_MASK         (0xF00U)
#define NETC_SW_QOSVLANMPR_IPV2_DR2_SHIFT        (8U)
#define NETC_SW_QOSVLANMPR_IPV2_DR2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV2_DR2_SHIFT)) & NETC_SW_QOSVLANMPR_IPV2_DR2_MASK)

#define NETC_SW_QOSVLANMPR_IPV4_DR2_MASK         (0xF00U)
#define NETC_SW_QOSVLANMPR_IPV4_DR2_SHIFT        (8U)
#define NETC_SW_QOSVLANMPR_IPV4_DR2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV4_DR2_SHIFT)) & NETC_SW_QOSVLANMPR_IPV4_DR2_MASK)

#define NETC_SW_QOSVLANMPR_IPV6_DR2_MASK         (0xF00U)
#define NETC_SW_QOSVLANMPR_IPV6_DR2_SHIFT        (8U)
#define NETC_SW_QOSVLANMPR_IPV6_DR2(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_QOSVLANMPR_IPV6_DR2_SHIFT)) & NETC_SW_QOSVLANMPR_IPV6_DR2_MASK)

