Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_NETC_SW.h
#define NETC_SW_PCP2PCPMPR_PCP5_MASK             (0x700000U)
#define NETC_SW_PCP2PCPMPR_PCP5_SHIFT            (20U)
#define NETC_SW_PCP2PCPMPR_PCP5(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_PCP2PCPMPR_PCP5_SHIFT)) & NETC_SW_PCP2PCPMPR_PCP5_MASK)

#define NETC_SW_PCP2PCPMPR_PCP6_MASK             (0x7000000U)
#define NETC_SW_PCP2PCPMPR_PCP6_SHIFT            (24U)
#define NETC_SW_PCP2PCPMPR_PCP6(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_PCP2PCPMPR_PCP6_SHIFT)) & NETC_SW_PCP2PCPMPR_PCP6_MASK)

#define NETC_SW_PCP2PCPMPR_PCP7_MASK             (0x70000000U)
#define NETC_SW_PCP2PCPMPR_PCP7_SHIFT            (28U)
#define NETC_SW_PCP2PCPMPR_PCP7(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_PCP2PCPMPR_PCP7_SHIFT)) & NETC_SW_PCP2PCPMPR_PCP7_MASK)
/*! @} */

/* The count of NETC_SW_PCP2PCPMPR */
#define NETC_SW_PCP2PCPMPR_COUNT                 (2U)

/*! @name BRCAPR - Bridge capability register */
/*! @{ */

#define NETC_SW_BRCAPR_IPV4MFLT_MASK             (0x1U)
#define NETC_SW_BRCAPR_IPV4MFLT_SHIFT            (0U)
/*! IPV4MFLT - L2 IPv4 multicast filtering supported.
 *  0b0..Not supported
 *  0b1..Supported
 */
#define NETC_SW_BRCAPR_IPV4MFLT(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_BRCAPR_IPV4MFLT_SHIFT)) & NETC_SW_BRCAPR_IPV4MFLT_MASK)

#define NETC_SW_BRCAPR_STAMVD_MASK               (0x4U)
#define NETC_SW_BRCAPR_STAMVD_SHIFT              (2U)
/*! STAMVD - Station Move Disable supported
 *  0b0..Not supported
 *  0b1..Supported
 */
#define NETC_SW_BRCAPR_STAMVD(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_SW_BRCAPR_STAMVD_SHIFT)) & NETC_SW_BRCAPR_STAMVD_MASK)

#define NETC_SW_BRCAPR_STRMCTRL_MASK             (0x8U)
#define NETC_SW_BRCAPR_STRMCTRL_SHIFT            (3U)
/*! STRMCTRL - Storm Control supported.
 *  0b0..Not supported
 *  0b1..Supported
 */
#define NETC_SW_BRCAPR_STRMCTRL(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_BRCAPR_STRMCTRL_SHIFT)) & NETC_SW_BRCAPR_STRMCTRL_MASK)

#define NETC_SW_BRCAPR_SRCPPRND_MASK             (0x10U)
#define NETC_SW_BRCAPR_SRCPPRND_SHIFT            (4U)
/*! SRCPPRND - Source port pruning disable supported
 *  0b0..Source port pruning disable not supported
 *  0b1..Source port pruning disable supported
 */
#define NETC_SW_BRCAPR_SRCPPRND(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_BRCAPR_SRCPPRND_SHIFT)) & NETC_SW_BRCAPR_SRCPPRND_MASK)

#define NETC_SW_BRCAPR_EVLANXLATE_MASK           (0x20U)
#define NETC_SW_BRCAPR_EVLANXLATE_SHIFT          (5U)
/*! EVLANXLATE - Egress VLAN translation supported
 *  0b0..Egress VLAN translation not supported
 *  0b1..Egress VLAN translation supported
 */
#define NETC_SW_BRCAPR_EVLANXLATE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_SW_BRCAPR_EVLANXLATE_SHIFT)) & NETC_SW_BRCAPR_EVLANXLATE_MASK)

#define NETC_SW_BRCAPR_NUM_STG_MASK              (0x3000U)
#define NETC_SW_BRCAPR_NUM_STG_SHIFT             (12U)
#define NETC_SW_BRCAPR_NUM_STG(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_BRCAPR_NUM_STG_SHIFT)) & NETC_SW_BRCAPR_NUM_STG_MASK)
/*! @} */

/*! @name VFHTCAPR - VLAN filter hash table capability register */
/*! @{ */

#define NETC_SW_VFHTCAPR_ACCESS_METH_MASK        (0xF00000U)
#define NETC_SW_VFHTCAPR_ACCESS_METH_SHIFT       (20U)
#define NETC_SW_VFHTCAPR_ACCESS_METH(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTCAPR_ACCESS_METH_SHIFT)) & NETC_SW_VFHTCAPR_ACCESS_METH_MASK)
/*! @} */

/*! @name VFHTOR - VLAN filter hash table operational register */
/*! @{ */

#define NETC_SW_VFHTOR_NUM_ENTRIES_MASK          (0xFFFU)
#define NETC_SW_VFHTOR_NUM_ENTRIES_SHIFT         (0U)
#define NETC_SW_VFHTOR_NUM_ENTRIES(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTOR_NUM_ENTRIES_SHIFT)) & NETC_SW_VFHTOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name VFHTDECR0 - VLAN Filter (hash) table default entry configuration registers 0 */
/*! @{ */

#define NETC_SW_VFHTDECR0_PORT0_MASK             (0x1U)
#define NETC_SW_VFHTDECR0_PORT0_SHIFT            (0U)
/*! PORT0 - Port n
 *  0b0..Port is not a member of this VLAN.
 *  0b1..Port is a member of this VLAN.
 */
#define NETC_SW_VFHTDECR0_PORT0(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR0_PORT0_SHIFT)) & NETC_SW_VFHTDECR0_PORT0_MASK)

#define NETC_SW_VFHTDECR0_PORT1_MASK             (0x2U)
#define NETC_SW_VFHTDECR0_PORT1_SHIFT            (1U)
/*! PORT1 - Port n
 *  0b0..Port is not a member of this VLAN.
 *  0b1..Port is a member of this VLAN.
 */
#define NETC_SW_VFHTDECR0_PORT1(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR0_PORT1_SHIFT)) & NETC_SW_VFHTDECR0_PORT1_MASK)

#define NETC_SW_VFHTDECR0_PORT2_MASK             (0x4U)
#define NETC_SW_VFHTDECR0_PORT2_SHIFT            (2U)
/*! PORT2 - Port n
 *  0b0..Port is not a member of this VLAN.
 *  0b1..Port is a member of this VLAN.
 */
#define NETC_SW_VFHTDECR0_PORT2(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR0_PORT2_SHIFT)) & NETC_SW_VFHTDECR0_PORT2_MASK)

#define NETC_SW_VFHTDECR0_PORT3_MASK             (0x8U)
#define NETC_SW_VFHTDECR0_PORT3_SHIFT            (3U)
/*! PORT3 - Port n
 *  0b0..Port is not a member of this VLAN.
 *  0b1..Port is a member of this VLAN.
 */
#define NETC_SW_VFHTDECR0_PORT3(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR0_PORT3_SHIFT)) & NETC_SW_VFHTDECR0_PORT3_MASK)

#define NETC_SW_VFHTDECR0_PORT4_MASK             (0x10U)
#define NETC_SW_VFHTDECR0_PORT4_SHIFT            (4U)
/*! PORT4 - Port n
 *  0b0..Port is not a member of this VLAN.
 *  0b1..Port is a member of this VLAN.
 */
#define NETC_SW_VFHTDECR0_PORT4(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR0_PORT4_SHIFT)) & NETC_SW_VFHTDECR0_PORT4_MASK)

#define NETC_SW_VFHTDECR0_STG_ID_MASK            (0xF000000U)
#define NETC_SW_VFHTDECR0_STG_ID_SHIFT           (24U)
#define NETC_SW_VFHTDECR0_STG_ID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR0_STG_ID_SHIFT)) & NETC_SW_VFHTDECR0_STG_ID_MASK)

#define NETC_SW_VFHTDECR0_IPMFE_MASK             (0x20000000U)
#define NETC_SW_VFHTDECR0_IPMFE_SHIFT            (29U)
/*! IPMFE - IP Multicast Filtering Enable
 *  0b0..No IP multicast filtering is performed.
 *  0b1..If the frame is identified as a multicast IP packet, then IP multicast filtering is performed. If the
 *       frame is not identified as an IP multicast packet, the IP multicast filtering is not performed.
 */
#define NETC_SW_VFHTDECR0_IPMFE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_VFHTDECR0_IPMFE_SHIFT)) & NETC_SW_VFHTDECR0_IPMFE_MASK)

